package forher.drink;
import java.util.Scanner;
public class Drink extends MakeFan {
    public Drink(String firstname, String lastname, String nickname) {
        super(firstname, lastname, nickname);
    }

    @Override
    public void FirstMet() {
        System.out.println("\nณ วันแรกที่เรา 2 คน เจอกัน : เราเจอกันได้ยังไงน้าาติ๊กต๊อกกๆๆ เธอกะเค้าเจอกันผ่าน Drink on me ละเรา2คนมีโอกาสได้คุยกันแบบ" +
                "\nไม่เห็นหน้ากัน ความรู้สึกเค้าตอนนั้นคือแบบ รู้สึกดีมากๆตอนนั้นที่คุยกับเธอ เธอรู้ตัวมั้ยว่าเธอเป็นเด็กที่คุยสนุกมากๆเลยนะคะ" +
                "\nความรู้สึกเค้าตอนนั้นคือแบบ เธอดูเป็นคนที่ใส่ใจมากๆอ่ะ ละก็เป็นแม่สาว Extrovert เค้ารู้สึกว่าเธอเป็นคนที่เข้าหาคนอื่น" +
                "\nได้น่ารักมากๆ หลังจากนั้นเค้าก็ขอ IG เธอ แล้วเธอก็ให้เค้า แฮะๆๆ (น่ารักแบบตะโกนน อ๊ากกก)");

        System.out.println("แล้วตอนที่เธอรู้จักเค้าครั้งแรกรู้สึกยังไงหรอคะ : .............");
        System.out.println("----------------------------------------------------------------------------------------------------");
    }

    @Override
    public void IThink() {
        System.out.println("เหตุการณ์ไม่คาดฝันที่โจโก้เจอ5555 : คือตอนนั้นนั่งยุกับเพื่อนละแบบบอกว่าเธอน่ารักมากๆ คือถูกใจตั้งแต่เรายังไม่เห็นหน้ากันแล้วอ่ะ" +
                "\nละพอมาส่อง IG ละไปเห็นเธอยืนจับมือกับคนคนนึงอยู่ นี่ก็เลยคิดว่า เธออาจจะถ่ายแบบอะไรอย่างงี้ก็ได้ นี่ก็ไม่อยากคิดมาก พอไปดู Post ที่ Tag" +
                "\nก็เลยได้รู้ว่าตอนนั้นเธอมีแฟนแล้ว ละคือตอนนั้นแบบเส้ามากก งอมในห้องเรียน แล้วตอนนั้นนี่ก็แบบไม่อยากพลาดอ่ะก็เลยจีบเธอทั้งๆที่รู้ว่าเธอมีแฟน" +
                "\nContent จัดเลอ 55555 (เราอยากได้ง่ะะ5555)");

        System.out.println("แล้วตอนนั้นเธอคิดกับเค้ายังไงหรอคะที่แบบอยู่ๆมาจีบทั้งๆที่มีแฟนแล้ว : ...............");
        System.out.println("----------------------------------------------------------------------------------------------------");
    }

    @Override
    public void IFeelsBad() {
        System.out.println("ตัดมาตอนที่่เราแอบคุยกัน 5555 : ความรู้สึกเค้าตอนนั้นคือแบบ เค้าอยากมีเธอจริงๆนะ เค้าแบบดีใจมากอ่ะที่เธอเล่นด้วย" +
                "\nแต่พอเรา 2 คนได้โทรกัน ละตอนนั้นเธอบอกว่า เดี๋ยวหนูไปคุยกับแฟนก่อนนะ ความรู้สึกคือแบบ เออว่ะ น้องเขาก็มีแฟน แต่นี้กับรู้สึกแบบมากๆอ่ะ" +
                "\nตอนนั้นคือนั่งงอมเลยอ่ะ แบบเค้าโคตรรู้สึกดีกับเธอจริงๆ แต่แบบตอนนั้นออกหน้าออกตาอะไรมากไม่ได้ เพราะเธอก็มีแฟนของเธออยู่");

        System.out.println("อันนี้เค้ารู้จากเธอแนะๆ เรื่องคนนั้นง่ะ ม่ายถามๆๆๆ ต่อปายยๆๆ");
        System.out.println("----------------------------------------------------------------------------------------------------");
    }

    @Override
    public void Moment() {
        System.out.println("Moment ที่น่ารักของเจ้าเด็ก : คือเท่าที่จำได้ง่ะคือมีเด็กแถวนี้ตั้งใจดูเค้าเล่นเกมมากๆ นี่คือแบบดีใจมากๆ เพราะแบบ" +
                "\nที่ผ่านมาไม่มีใครตั้งใจดูเท่าเธอแล้ว เธอเป็นคนที่ใส่ใจรายละเอียดมากๆ แบบเธอดูแล้วเธอมีถามอันนู้นอันนี้ไปด้วย แสดงว่าเธอดูจริงๆ" +
                "\nละก็เธอก็จะมีมุมที่น่ารักต่างๆ เช่นเป็นเด็กขี้อ้อน ทำไรก็บอกเค้า มีใครแอดมาก็บอก ไม่ปิดบัง เปิดแชทให้ดู เค้ารู้สึกชอบมากๆเลยที่แบบ" +
                "\nเธอกล้าให้เค้าไปดูและอยู่ในพิ้นที่ส่วนตัวเธอได้ บางมุมง่ะ เค้าก็เป็นเด็กงี้ ก็จามีเธอที่แบบพูดมีเหตุผล ให้เค้าได้คิดว่าแบบบางทีเค้าก็งอแงเกินไป" +
                "\nมันแบบไม่ส่งผลดีกับเธอและเค้าแน่ๆในระยะยาว เค้าเลยงอมน้อยลง ดูเหตุและผลมากกว่าเดิม เค้าลดความดื้อและงอแงได้เพราะเธอเลยนะ" +
                "\nเค้าขอบคุณมากๆนะคะ");

        System.out.println("เค้าอยากรู้ Moment ที่เค้าทำให้เธอแล้วเธอก็รู้สึกดีกับเค้าง่ะ เล่าให้ฟังหน่อยได้อะเป่าา : .................");
        System.out.println("----------------------------------------------------------------------------------------------------");
    }

    @Override
    public void Makef() {
        System.out.println("สุดท้ายแล้วนะคะ : เค้ารู้สึกดีกับเธอแบบมากๆ และปล่อยเธอไปไหนไม่ได้จริงๆ เพราะฉะนั้นแล้ว เป็นแฟนกันนะคะ><");
        Scanner scanner = new Scanner(System.in);
        System.out.print("Enter your Answer (Yes or No) : ");
        String name = scanner.nextLine();
        scanner.close();
        if (name.equalsIgnoreCase("Yes")){
            System.out.println("โจโก้มีแฟนแล้วเย้~~~~~");
        } else {
            System.out.println("เค้าก็เข้าใจเธอนะคะถ้ามันเร็วไปจริงๆ ยังไงเค้าก็จีบเธอต่อแน่นอน แบร่ๆๆ");
        }
        System.out.println("----------------------------------------------------------------------------------------------------");
        System.out.println("ขอบคุณสำหรับเรื่องราวดีๆตลอด 1 เดือนที่ผ่านมานะคะ");
    }
}
